{
  "title": "Deciding the fate of the world",
  "description": "In July of 1961, the Soviet nuclear submarine K-19 was conducting exercises, and like the Titanic, was on its maiden voyage in the North Atlantic ocean off the south-east coast of Greenland when it experienced a catastrophe. Its coolant system broke, causing the nuclear reactor to overheat. The sub was designed to have a backup cooling system but one wasn’t installed. The captain of the sub, Nikolai Zateyev, had to make a quick and crucial decision. If the reactor couldn’t be cooled, a melt down would occur, with a possible explosion blowing the sub apart and sending it to the bottom of the ocean where radioactive material could potentially contaminate the environment. There was also the possibility that the Americans could retrieve parts of the sub and gain knowledge of the Soviet’s technology. Letting the sub fall into the hands of the Americans was out of the question. There was also no way of contacting Moscow because the communication equipment had malfunctioned earlier in an unrelated incident. For this reason, Zateyev made the fatal decision to send a crew to see if they could repair the damage. But this would expose them to high levels of radiation and was essentially a death sentence. Although the crew was successful in repairing the damage, the amount of radiation they received was indeed lethal. Eight of the crew members died within a month and 15 more over the next two years. Everyone on board had been irradiated by the radioactive material that had worked its way throughout the sub. But one particular officer by the name of Vasily Arkhipov survived and a year later was stationed on another sub, known as the B-59, just off the coast of Cuba.\\n\\nBy this time, the Soviets had stationed nuclear missiles on Cuba. Taking this as a threat, the US demanded that the missiles be removed and sent its navy to patrol the international waters off the coast of Cuba to intercept any Soviet ships and submarines that it came across. When the navy intercepted the B-29, they dropped depth charges with the intent of forcing the sub to surface and identify itself. The crew of the B-29 along with several other Soviet subs in the area were fully aware that they were on the verge of a nuclear war when the Soviets placed the missiles on Cuba. In the chance that a nuclear war had started, they were authorized to launch their nuclear torpedos on the US ships but only when the top three officers onboard agreed unanimously to launch them. Hearing the depth charges going off, the commanding officer of the B-59 took this as a sign that the war had started. But being at such a deep depth, they had no way of contacting Moscow for instructions and so made the decision to vote on whether to launch the nuclear torpedoes. Two of the officers agreed to launch the nuclear weapons but Arkhipov disagreed and argued that firing on the US navy was a really bad idea and that the US navy was only trying to determine their identity. Arkhipov argued that they needed to surface and try and contact Moscow before concluding that they were at war. The other officers relented and agreed to surface where they learned that they were in fact not at war with the US.\\n\\nArkhipov was 36 years old at the time and died at 72 from kidney cancer, most likely the result of the radiation he was exposed to on the K-19.\\n\\nOn the K-19 sub, commanding officer Zateyev had to apply critical thinking and made a decision that would cost the lives of 22 men. On the B-59, Arkhipov also had to apply critical thinking and his decision arguably saved the lives of 3 billion people.\\n\\nBoth Zateyev and Arkhipov had to quickly assess the situation they were in and make a critical decision that would seal the fate of others. But what we don’t usually consider when these situations arise are those who played an important role that led up to the incident. In the case of the K-19 incident, someone had to have made the decision not to install a backup cooling system nor a backup communications system - two of the most vital pieces of infrastructure on a nuclear sub. For the B-59 incident, someone higher up had to have realized that it could be a fatal mistake if only one person had to make the decision to launch the nuclear torpedoes and for that reason required three people to unanimously agree on it. When the Titanic sank, there were only enough lifeboats for half the passengers. The lack of lifeboats wasn’t just the responsibility of the ship’s owner, White Star, but also those of the ship’s builder, Harland and Wolff as well as the government regulatory body. There was no regulation requiring enough lifeboats to cover all passengers. So to keep costs down and the ship looking more aesthetic, the decision was made to not include more than was necessary, which was a number based on the weight of the ship.",
  "discussionUrl": "https://www.reddit.com/r/IsThatSo/comments/1dnbwf2/deciding_the_fate_of_the_world/",
  "solution": "As I pondered the decision made by Zateyev, I questioned whether he made the right choice. The arguments against abandoning the sub and sinking it to the bottom of the ocean so that it wouldn’t pose an environmental catastrophe and preventing it from falling into enemy hands, didn’t really make sense. Radiation can travel at most a few meters in water, and usually it’s more like a few centimeters. Had the sub been sunk, it would have landed around 4 kilometers at the bottom of the ocean. There was virtually no chance of any radiation at that depth having any effect on what little biosphere existed at that depth. Then there is the argument of the enemy recovering any technology from the sunken sub. Retrieving anything at that depth is even in 2024 an extremely difficult undertaking and therefore would have been virtually impossible 60 years earlier. There could have also have been a contingency plan to destroy the most important equipment through a time delayed bomb that would have gone off after the crew left the sub. But we’re talking about a communist regime in the Soviet Union that cared little for soldier safety and dying for the motherland had the highest priority. And we still see it today in Russia when Putin treats his soldiers like cannon fodder.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "hard"
}