{
  "title": "Fake it till you make it",
  "description": "One thing a lot of people will do at some point is to invest in a business, either as a shareholder by buying stocks, or investing directly in a company. But people get burned all the time for various reasons. In the following exercise, you will be presented with 2 startups that were worth billions at their peak. In each of these cases, their founders were convicted of fraud and sent to prison leaving their investors badly burned. Both companies are very similar in how they carried out their fraud. Your challenge is to determine what red flags these companies raised and what would you as an investor would have done differently once you had recognized the red flags? You don’t need any background in investing or in the industry that these companies operate in, or have any college education to be able to recognize the red flags because even professional investors often fail to recognize these red flags.\\n\\n## Theranos\\n\\nElizabeth Holmes, the founder of the startup Theranos pitched a device, she called the “Edison”  to investors. She claimed that with a single drop of blood, the device was capable of running 70 different tests to detect a  broad range of medical issues in a short time, unlike the traditional method where a person had to submit a vile of blood and have it manually tested by various methods and machines in a lab. There was only one problem. She faked the data that the device was giving. In 2015, a journalist was tipped off by a medical expert about suspicions that the device couldn’t do what Holmes claimed it could and after connecting with whistleblowers, published an article in The Wall Street Journal that claimed that not only did the device produce inaccurate results but most of the testing was done in a lab using standard medical equipment. Three years later she was convicted of fraud and swindling $700 million from investors. Holmes was able to entice investors because she had the endorsement of high profile men including Henry Kissenger, George Schultz and James Mattis, who all served Presidents of the United States. She also created a fake deep voice and dressed in black attire including a turtleneck, to mimic her idol Steve Jobs and portray what she believed was a more confidential image typically seen more dominant in businessmen in Silicon Valley. Theranos was a private company.\\n\\n## Nikola\\n\\nTrevor Milton, the founder of the startup Nikola, who manufactures heavy duty EVs and hydrogen cells, posted a promotional video in 2017 showing a truck driving down a desert highway powered by what Nikola claimed were hydrogen fuel cells. He also claimed that his vehicles had zero emission. Three years later, GM bought an equity stake in Nikola worth about $2 billion with GM set to manufacture Nikola’s trucks in their own plants. But just two days after making this deal, the short selling investment firm Hindenburg Research, with the help of a whistleblower, published a report that claimed that Nikola was a fraudulent company, that they had no product, and that the promotional video three years earlier was staged by letting a truck roll down a hill under the force of gravity. When Nikola admitted to the staged video, their stock fell sharply and GM pulled out of their deal. GM’s CEO Mary Barra, claimed that GM had done its due diligence on Nikola prior to investing in them. Clearly they didn’t and as of 2024, Barra still remains the CEO of GM. Nikola was a public company.\\nRed Flags\\nThe first big flag that both Theranos and Nikola raised that should have alerted investors was the fact that nobody outside of their company had ever had the product to examine. Theranos gave some demonstrations of their Edison device but faked the data and Nikola showed a truck rolling down a hill. But like the motto goes, “Fake it till you make it” has been carried out since the history of mankind.\\n\\nThen there were the extraordinary claims. Claiming to diagnose many ailments with the prick of blood on a desktop device is something most people in the medical community doubted. Claiming that his vehicles had zero emission is something any engineer in the automotive industry would have found unbelievable.\\n\\nThe founder’s background should have raised flags. Neither Holmes nor Milton had experience in their industry. Both Holmes and Milton were college dropouts.\\n\\nSo what could investors have done differently?",
  "discussionUrl": "https://www.reddit.com/r/IsThatSo/comments/1dnc1qh/fake_it_till_you_make_it/",
  "solution": "Due diligence was clearly lacking. Investors could have demanded that qualified medical experts perform their own independent testing with the Edison device and could have done this in a Theranos lab without actually seeing what was in the device.They would have instantly realized that the claims by Holmes were false. As for GM’s claim that they did their due diligence on Nikola, this can only show that they were either lying or were very incompeten. And all it would have taken to expose Nikola’s lies was to send a team of engineers to do a thorough inspection of the vehicles. This wouldn’t have been an issue given that GM was to manufacture the vehicles at their plants and therefore secrecy about Nikola’s technology could not be hidden.\\n\\nThe “fake it till you make it” approach isn’t illegal or even a bad approach to getting investors on board, as long as what you are faking is something you can realistically build within a reasonable amount of time, or where you need money to complete a prototype that you are pretty sure will work. Dropbox, Airbnb and Tesla were companies that took the “Fake it till you make it” approach, where they managed to acquire investors without even having a real product. But Elizabeth Holmes’ Edison device was not only incapable of doing what she claimed, but experts agreed that it would take many years for it to become a reality. By lying to investors about a product that didn’t work, she crossed a red line. Even worse was that she was playing with people’s lives by producing inaccurate blood tests.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "moderate"
}