{
  "title": "Renting an apartment over a business",
  "description": "You visit an apartment that you are interested in renting. The apartment looks really nice, is located about 100 meters from a large beautiful lake and  has a monthly price that is lower than most apartments in the area. You do find it odd that the price is lower because homes on or near the lake are generally considered prime property. The apartment is part of a larger building that the owners also live in. Next to this building is a very nice country style hotel that also hosts events throughout the year in their main hall. The owners of the apartment are also the owners of the hotel.\\n\\nWhen you visit the apartment, the visitation is arranged with a real estate agent. The owners are not present. Your impression of the apartment is that it is nicely renovated and located in a quiet setting.\\n\\nThe only thing that catches your eye is that when you are outside, beneath the apartment is what appears to be a restaurant or cafe although it is clearly closed. You then inquire of the real estate agent what it is. They respond that it is a cafe but is only open during the summer season and only until 10:00 in the evening. It is currently winter and in the off season. The cafe is also owned by the apartment owner but leased out to someone during its seasonal operation. This doesn't bother you as you go to bed at 10:00 pm and are away during the day. Nevertheless, your gut feeling tells you that something seems fishy and you would like to ask the owners some questions about the cafe but they are not available.\\n\\nDo you take the apartment right there and then, or wait until you have an opportunity to talk to the owners? If you don't take the apartment now, others who have interest are likely to take it and you will have lost out on a great apartment in a fantastic location.",
  "discussionUrl": "https://www.reddit.com/r/CriticalThinkn/comments/1d8kop1/renting_an_apartment_over_a_business/",
  "solution": "Being overcome by impluse, you decide to rent the apartment without first talking to the owner about the cafe. You move in right away and being the off season, the cafe is closed. But then around 9:00 that evening, very loud music suddenly starts and you realize that it is coming directly below your apartment from the cafe. You head outside to see what is happening to only discover that this was in fact not a cafe but a bar and it opens up every night, 7 days a week, all year round. The music plays loud until 1:00 in the morning. You also discover that they regularly host live bands.\\n\\nYou now realilzed that you were duped by the real estate agent and now know why the owners were not present. While you could just cancel the apartment, you did pay a thousand dollars to the real estate agent for their fee and you must give the owner a 3 month notice before you can vacate the apartment.\\n\\nHow could this have been avoided?\\n\\nEven though the owner was not available during your visit, you could have used your smartphone and brought up Google Maps and located the cafe on the map. It would have been clearly labeled as a bar and shown it's opening hours. This would have immediately told you that the real estate agent was lying.\\n\\nYou could have also have gone across the street to where several homes were located and asked people there whether the cafe was actually a cafe. They would have known that it was a bar opened late into the night.\\n\\nDoing a google search on the real estate company as well as the agent may have brought up negative reviews about their deceptive practices.\\n\\nUpon closer inspection to the advertisements stuck to the inside of the windows of the cafe you would have noticed that a live band was being advertised to play there that month along with the late hours that they would be performing. This would have immediately raised the question how it could be a cafe closed during the off season. In summary, remember the following when visiting an apartment that is located above a business:\\n\\n* Use Google Maps to see if the cafe is located on the map. If the opening hours are not listed, check the reviews and if you see any that were posted on dates that are not during the open season, this should indicate that the real estate agent is lying about the business hours.\\n* Check with the neighbors and ask them about the place.\\n* Research the real estate company and the agent before making a visit and check for any negative reviews that may be posted.\\n * Check for anything on the building that could give you a clue about what really goes on inside and what the business hours actually are. If you don't see anything that says \"closed from November to April\" to indicate  an off season, assume it's always open.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  }
}