{
  "title": "Taking a vaccine developed with new technology",
  "description": "In 2020 when the COVID-19 pandemic hit the world, there was global fear that the death toll could run into the tens or hundreds of millions. This was the first major pandemic since the Spanish Flu that ran from 1918 to 1920 and killed upwards to 5% of earth’s population, which was around 2 billion at that time. With a population of around 8 billion in 2020, 5% would amount to around 400 million dead - more than the entire population of the US and Canada combined.\\n\\nCreating a vaccine under normal conditions for a new virus would normally take around 10 years, going through many trials before being approved. The actual development time is significantly less. When the german biotech company BioNTech announced that they had developed a vaccine against the COVID coronavirus only 4 months after the pandemic began, the world was rather taken by surprise. Several months later, BioNTech in collaboration with Pfizer were able to mass produce the vaccine.\\n\\nAs a 40 year old, you face a major decision - to take the vaccine or not. To complicate matters, your 65 year old mother lives with you and she is overweight with frail health. Studies on those who died from COVID suggested that a significant percentage of them were overweight.\\n\\nYour challenge? Decide whether to take the vaccine or not and describe how you came to that decision.",
  "discussionUrl": "https://www.reddit.com/r/IsThatSo/comments/1dnbp79/taking_a_vaccine_developed_with_new_technology/",
  "solution": "Because the technology behind the vaccine is rather new, you feel like you might just end up being a lab rat along with millions of others and could face all kinds of potential side effects. Videos on social media show some people who received the vaccine suddenly developing magnetism, or becoming infertile. Some claimed that it altered a person’s DNA which could cause potentially any kind of harm to the body and would be inherited by any children you have.\\n\\nThese were just a few of the many side effects circulating on social media. Not being a trained molecular biologist, you couldn’t tell what was true or false. Would you also take the word of Pfizer, a pharmaceutical company that has been convicted in the past and setttled lawsuits worth millions and billions for producing a medicine that was known to be harmful?\\n\\nYou decide that in order to even make an educational decision, you really need to understand the technology behind the virus. You’re not a biologist, so you need to figure this out in laymen’s terms.\\n\\nYou discover that BioNTech had already been working on the mRNA technology for over a decade. mRNA is essentially injecting a DNA sequence into the cell and allowing the cell’s machinery to use this sequence to produce a protein. In the case of the COVID-19 coronavirus, the DNA sequence was taken from the virus and was used to create the spike protein on the surface of the cell which would trigger an immune response, allowing the body’s immune system to generate antibodies to fight what it perceived as a foreign pathogen, or more accurately, a simulated coronavirus. In essence, this was a “fake it till you make it” approach by which the cells fool the body into thinking it was being invaded by the coronavirus but without having an actual coronavirus that destroys the cells. By tricking the  body into premanufacturing the antibodies, the immune system wouldn’t need much time to create the antibodies in the future, should the body be infected by the actual coronavirus. This would allow the immune system to launch a much quicker response in killing off the virus.\\n\\nYou also learn that vaccines have been used for the past 200 years to trick the body into creating antibodies.This has been enormously successful and has saved millions of lives. But this was mostly done by injecting a weakened form of the virus into a body. mRNA however is about injecting part of a virus’ DNA into a cell in order for it to produce a spike protein. How can you possibly know that once it enters the cell, that it doesn’t alter your own DNA? Digging a litte deeper, you come to understand that there are mechanisms in place in the cell from preventing foreign mRNA from entering the nucleus. So there is no chance of it altering your DNA.\\n\\nAs you dig deeper into understanding the mRNA technology, you gain more confidence that this technology is safe. You also spend time investigating claims about the side effects and discover that almost none of them are true and many fake articles and videos are created just to generate views. Side effects certainly do exist but it isn’t clear how severe they are and how many people are likely to get them for the simple reason that the vaccine hasn’t been tried on millions or even hundreds of thousands of people.\\n\\nYou finally come to a conclusion. If you don’t take the vaccine and you get infected by the cooronavirus, not only do you risk being severely ill and possibly dying, but you could put your mother in grave danger as well. If you do take it, you are not sure of the side effects it will have on you..\\n\\nFor the sake of your mother, you decide to take it and you convince your mother to take it as well. Two weeks later you start experiencing vertigo and discover that many who took the vaccine also experienced vertigo but have indicated that it went away after a few days. Vertigo was not on the list of side effects at the time you took the virus. You are of course nervous and it bothers you that the vertigo could have happened while driving a car which could have caused you to lose control of the vehicle. A few days later, the vertigo is gone. Whether you will experience long term side effects isn’t something you may never definitely know.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "moderate"
}