{
  "title": "When to give a child a smartphone",
  "description": "At some point, every parent must make the decision when to allow their child to have a smartphone. There  are various views on this. Some advocate not giving a child a smartphone until they are 13, others say 16 while some will even give a 7 year old a device. Deciding to give your child a smartphone, or not, is a serious decision that can have potential effects on them over the years. Most psychologists don't recommend giving a child a smartphone until they are 13 because up until that age, a child's brain is still going through development stages and a child can be strongly influenced for better or worse by the use of a smartphone.\\n\\nRealistically however, children live in a society that includes sex predators, school bullies and peer pressure to present oneself online in ways that don't reflect reality. A parent's worst nightmare is having their child commit suicide because nude photos of them were posted online. With the rise of AI, fake images and videos can be easily created by evil actors who steal a child's photo from online and you don't even need to be tech savvy to do this. Fellow students can easily utilize these tools.\\n\\nAt the same time, every parent does want to keep track of where their child is and have some way of communicating with them, especially if they walk to and from school alone before the age of 13. One solution that is supported by psychologists is to give them a feature phone instead of a smartphone, which is a phone reduced to little more than making phone calls and sending text messages, while some feature phones have features like GPS with maps.\\n\\nMany schools are increasingly adopting a non-phone policy that prohibits the use of phones in classrooms, but during breaks, many if not most kids will resort to using their phones instead of physically engaging fellow students in face-to-face dialogues. Because schools cannot completely prohibit the use of phones on their school grounds and because the majority of students are engaged with their phones, it is a weak argument to believe that by prohibiting your child from having a phone, it will lead to better one-on-one relationships.\\n\\nIf you decide to never give your child a phone until they are 16, then this challenge ends here. But if you do want to give your child a phone, you are faced with the following questions that need to be answered:\\n\\n1. Whether to start out with a feature phone and eventually allow a smartphone.\\n2. How to know when your child is ready for a smartphone.\\n3. Whether to go with an Android, iPhone or some other operating system.\\n4. How much parental control to have over their phone.\\n5. The types of content that they are allowed to access and how this changes as they get older.",
  "discussionUrl": "https://www.reddit.com/r/CriticalThinkn/comments/1d8kop1/renting_an_apartment_over_a_business/",
  "solution": "## Feature Phone vs. Smartphone\\n\\nWhile smartphones are by far the most used type of mobile phones, feature phones are still widely used and available, especially by older people who prefer to keep things simple and have no use for apps. If you  want to give your child a feature phone, you need to be aware that many of these feature phones have support for browsing the web and using social media.  When a feature phone ships with these apps, they cannot be uninstalled. If your objective is to prevent your child from accessing inappropriate content online or from using any social networks, you need to be careful to select a feature phone that doesn't have a built-in mobile browser or any social networking apps. There are feature phones available and don't have any mobile browser or social networking apps but only ship with basic apps like a calendar and calculator. You also need to take care that the phone doesn't have an app store app installed that allows them to download apps.\\n\\nWhile a feature phone stripped of apps with Internet access is the safest approach, it is still possible to achieve a satisfactory level of security using a smartphone. Android and iOS phones don't by default have parental controls installed but these can be added. Google provides their \"Google Family Link\" app that allows parents to have strict control over their child's phone. Google Family Links offers:\\n\\n* Set screen time limits on your child’s Android or ChromeOS devices;\\n* See the location of your child’s signed-in and active Android devices;\\n* Approve your child’s downloads and purchases on Google Play and Stadia or limit the visibility of content based on maturity ratings;\\n* Help your child choose the types of activity that can be saved in their Google Account and how it may be used to personalize their experience;\\n* Manage settings such as SafeSearch for Google Search;\\n* Review your child’s app permissions, such as microphone, camera, and contacts access on Android and ChromeOS;\\n* Change the content, access and other settings for YouTube experiences (where available), including YouTube and YouTube Kids.\\n\\nIt should be noted however that even turning on Safe Search for their browser doesn't guarantee that they won't be able to visit unsafe content. Using Google Family Link, it is possible however to disable apps including the browser. Keep in mind though that many apps often provide access to the Web from within their own app but don't require an external browser. Technically, it is still possible to browse the web from within these apps. To be safe, you really should inspect all the features of the apps that get installed or contact the app developer and ask if there is any way their app allows someone to browse web sites.\\n\\nOne important thing to keep in mind when choosing an Android phone is that it must be compatible with Google Family Link. Check the Google Play Store to see what versions it supports. No sense in buying a used old Android phone only to discover that the Google Family Link app can't be installed.\\n\\n## Apple has their own parental control app known as Screen Time.\\n\\nFrom a security perspective, Android is a safer operating system than iOS. This is because Android is open source allowing developers to find security flaws. There are also many manufacturers of Android devices with each creating a custom operating system. This means that if a hacker exploits a security flaw in one manufacturer's device, there is a chance that this flaw isn't present on devices from other manufacturers. With Apple however, since Apple is the sole manufacturer with far fewer iPhone models than Android models, a security flaw on one model could more easily show up on all the other models since Apple is the sole developer of all the models.\\n\\n## When to Give Your Child a Smartphone\\n\\nWhether your child is ready for a phone doesn't depend on age but rather their maturity. Do they lose things often? Are they likely to say or do things they will regret? How sensitive to criticism are they? Do they respond well to limits on screen time? Have they ever been bullied and if so, how did they respond? If you give them money to spend on in-app purchases, are they going to blow all that money real quickly?\\n\\nThese are just some of the questions you need to ask. A child must be able to grasp the consequences they will be facing should it ever happen that they post something online that they would severely regret and realize that once posted, it can spread and never be deleted.\\n\\n## Controlling and Monitoring Your Child's Phone\\n\\nThere are some children in this world who are very mature at a young age and have proven that they  are trustworthy. But these are in a small minority. The vast majority of kids tend to be curious and want to go beyond limits imposed on them and break the rules. For them, trust is something that is earned over a long period of time. It's a gradual transition. This gradual trust should be extended with their use of the phone. Initially, parents should bolt everything closed on their child's phone and only over time, begin to relax the control as the child proves that they can be responsible.\\n\\nAs a parent, you can monitor all the data on your child's phone including calls made, text messages, photos and images, chat history, location history, apps installed, purchases made and the amount of time spent using any app. You can also limit the amount of time spent in any app. Because of this fine control, it is questionable whether a feature phone is even needed.\\n\\nAs a way of rewarding your child for their responsibility, over time you can gradually allow more apps to be installed and allocate more screen time.\\n\\n## Types of Apps to Allow\\n\\nMost kids are primarily interested in only three types of apps: Games, chatting and videos, with chatting being by far the most used, with WhatsApp being the number one app. Although WhatsApp is owned by Meta (who owns Facebook), it was developed by a different company who placed a lot of value on privacy.  The encryption used by WhatsApp is one of the strongest known and even Meta cannot read messages sent between two people. WhatsApp also requires that the mobile phone numbers of two people who want to communicate with each other are in each phone's contact list. This makes it impossible for a stranger to simply communicate with your child. Both parties had to know each other's number and have entered them into their contact. Parents have access to the contact list and can approve which phone numbers to allow. Parents should never allow a child to communicate with someone using WhatsApp if they don't know the person behind the phone number.\\n\\nMany parents allow their kids to play video games at home using the larger console devices like XBox. So it's unlikely that they will have a problem letting them play games on their phone. The major difference is that most mobile apps have in-app purchasing features. Most parents are not going to provide a credit card that allows their child to purchase unlimited amounts of in-app features. Instead, parents can use an app like Google Family Link to restrict purchasing until authorized. If a child wants to make a purchase, a request is first sent to the parents who can then decide whether to authorize it or not. This is actually better because the parent will see everything their child wants to purchase and can decide whether it should be approved or not.\\n\\nAs for videos, the only video platform that children should be using is YouTube for Kids. Google employs a very powerful and strict security system that is capable of providing only videos that are specifically geared towards children. This system supports local and national laws for various countries. Most videos  are flagged for human review if the content creator is not well known and hasn't established a large enough subscriber base on YouTube. Anyone caught uploading restricted content will generally get permanently banned after 3 strikes.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "moderate"
}