{
  "title": "When to give a child a smartphone",
  "description": "At some point, every parent must make the decision when to allow their child to have a smartphone. There  are various views on this. Some advocate not giving a child a smartphone until they are 13, others say 16 while some will even give a 7 year old a device. Deciding to give your child a smartphone, or not, is a serious decision that can have potential effects on them over the years. Most psychologists don't recommend giving a child a smartphone until they are 13 because up until that age, a child's brain is still going through development stages and a child can be strongly influenced for better or worse by the use of a smartphone.\\nRealistically however, children live in a society that includes sex predators, school bullies and peer pressure to present oneself online in ways that don't reflect reality. A parent's worst nightmare is having their child commit suicide because nude photos of them were posted online. With the rise of AI, fake images and videos can be easily created by evil actors who steal a child's photo from online and you don't even need to be tech savvy to do this. Fellow students can easily utilize these tools.\\nAt the same time, every parent does want to keep track of where their child is and have some way of communicating with them, especially if they walk to and from school alone before the age of 13. One solution that is supported by psychologists is to give them a feature phone instead of a smartphone, which is a phone reduced to little more than making phone calls and sending text messages, while some feature phones have features like GPS with maps.\\nMany schools are increasingly adopting a non-phone policy that prohibits the use of phones in classrooms, but during breaks, many if not most kids will resort to using their phones instead of physically engaging fellow students in face-to-face dialogues. Because schools cannot completely prohibit the use of phones on their school grounds and because the majority of students are engaged with their phones, it is a weak argument to believe that by prohibiting your child from having a phone, it will lead to better one-on-one relationships.\\nIf you decide to never give your child a phone until they are 16, then this challenge ends here. But if you do want to give your child a phone, you are faced with the following questions that need to be answered:\\nWhether to start out with a feature phone and eventually allow a smartphone.\\nHow to know when your child is ready for a smartphone.\\nWhether to go with an Android, iPhone or some other operating system.\\nHow much parental control to have over their phone.\\nThe types of content that they are allowed to access and how this changes as they get older.\\n\\n",
  "discussionUrl": "https://www.reddit.com/r/CriticalThinkn/comments/1d8kop1/renting_an_apartment_over_a_business/",
  "solution": "Being overcome by impluse, you decide to rent the apartment without first talking to the owner about the cafe. You move in right away and being the off season, the cafe is closed. But then around 9:00 that evening, very loud music suddenly starts and you realize that it is coming directly below your apartment from the cafe. You head outside to see what is happening to only discover that this was in fact not a cafe but a bar and it opens up every night, 7 days a week, all year round. The music plays loud until 1:00 in the morning. You also discover that they regularly host live bands.\\n\\nYou now realilzed that you were duped by the real estate agent and now know why the owners were not present. While you could just cancel the apartment, you did pay a thousand dollars to the real estate agent for their fee and you must give the owner a 3 month notice before you can vacate the apartment.\\n\\nHow could this have been avoided?\\n\\nEven though the owner was not available during your visit, you could have used your smartphone and brought up Google Maps and located the cafe on the map. It would have been clearly labeled as a bar and shown it's opening hours. This would have immediately told you that the real estate agent was lying.\\n\\nYou could have also have gone across the street to where several homes were located and asked people there whether the cafe was actually a cafe. They would have known that it was a bar opened late into the night.\\n\\nDoing a google search on the real estate company as well as the agent may have brought up negative reviews about their deceptive practices.\\n\\nUpon closer inspection to the advertisements stuck to the inside of the windows of the cafe you would have noticed that a live band was being advertised to play there that month along with the late hours that they would be performing. This would have immediately raised the question how it could be a cafe closed during the off season. In summary, remember the following when visiting an apartment that is located above a business:\\n\\n* Use Google Maps to see if the cafe is located on the map. If the opening hours are not listed, check the reviews and if you see any that were posted on dates that are not during the open season, this should indicate that the real estate agent is lying about the business hours.\\n* Check with the neighbors and ask them about the place.\\n* Research the real estate company and the agent before making a visit and check for any negative reviews that may be posted.\\n * Check for anything on the building that could give you a clue about what really goes on inside and what the business hours actually are. If you don't see anything that says \"closed from November to April\" to indicate  an off season, assume it's always open.",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "moderate"
}