{
  "title": "Working remotely",
  "description": "The COVID-19 pandemic forced most companies to allow their employees to work from home, if their job could be done remotely. For most employees who worked from home, this came as a welcomed benefit as they were able to save time by not having to commute. Many claimed that they were even more productive. Only a minority missed working in the office, where they felt they were more productive and enjoyed direct human interaction instead of a virtual interaction over a Zoom video meeting. Some CEOs, including Mark Zuckerberg, even said that working remotely would become a permanent policy that employees could choose if they wanted.\\n\\nFast forward a few years and oh how the situation changed. CEOs began to demand that employees return to the office, either full time or for a certain number of days in the week, in what became known as the hybrid model. And then there were CEOs like Zuckerberg, who reneged on their policy of allowing permanent work from home and demanded that employees return full time or risk being fired.\\n\\nWhat CEOs failed to realize was that the majority of remote employees had grown accustomed to this lifestyle change and didn’t want to return to the office. Many chose to quit and take up positions with companies that allowed remote work.\\n\\nSince the end of the pandemic, CEOs have struggled with employees over the work from home policy. But as the pandemic began to wind down, the tech industry began to see a major downturn, not seen since the DotCom bubble burst over two decades earlier. This was the result of several factors, including overhiring during the pandemic, high inflation, the war in Ukraine and the rise of AI. All of a sudden, employees had less bargaining power with employers on working remotely, since losing their job was a very real possibility.\\n\\nMany CEOs believe that their employees are more productive when working at the office. Studies have been carried out to determine whether that is true or not. Because each study tackled the issue from a different angle, there is no overwhelming definitive answer. Most employees who favor working from home will insist that they are more productive.\\n\\nYour challenge here isn’t to determine whether working in the office results in more productivity, but rather to determine how you came to your conclusion as to whether you believe or don’t believe that remote working is better than, worse than, or the same as working in the office.",
  "discussionUrl": "https://www.reddit.com/r/IsThatSo/comments/1dnbzsy/working_remotely/",
  "solution": "For this scenario, instead of resorting to studies that have attempted to determine whether working from home is more productive or less productive than working at the office, I’m going to draw upon my own personal experience having worked for several companies, both in the office and at home.\\n\\nWhen you make the claim that some particular car has a better performance than some other car, you can’t go by your gut feeling. You need to define the metrics that make up performance such as the amount of fuel the car consumes in city traffic over a given distance and time period. In the same manner, you need real metrics to determine whether someone is more productive working remotely than in the office.\\n\\nFor starters, it should be noted that there are many companies where all of their employees work from home, with some having doing it since the day they were founded, which includes companies like Zapir, GitLab and InVision. The question you have to ask yourself is, if these companies work entirely remote and are highly successful, what are they doing that other companies that are against remote work are not doing?\\n\\nThe key thing to focus on is what defines productivity. If your job is writing code, is it the number of lines of code? If you’re in sales, is it the number of sales you make a month? If your job is writing articles for your marketing blog, is it how many articles your post a month?\\n\\nIn many jobs, the word “productivity” is often associated with the word “quantity”, simply meaning how much of something you are producing. But is quantity an accurate way of measuring productivity? It would be if your job was to assemble x number of gadgets in a day on an assembly, or fill orders in a shipping department. But those kinds of jobs cannot be done remotely.\\n\\nFrom my experience over the decades, productivity was never about quantity. It was rather about completing a task by a particular deadline with the highest quality possible. For example, if you are tasked to develop a screen for a mobile app, as a developer you need to estimate how much time it will take to complete the task. If you completed the task by the deadline and there were no bugs in your software, you could consider that you were productive. But even this is not entirely accurate. You need a way of actually measuring the productivity to have a grasp on how productive you were. By using a systematic approach to quantifying productivity, you establish a baseline that indicates how productive you are on average. Once you establish this baseline, you are then able to determine how your productivity measures up when you are assigned a task.\\n\\nFor example, suppose your task is to design a screen for an app and you estimate that it will take you 7 work days to complete. If you managed to complete it say in 7 days, you were fairly accurate in your assessment of the work and how long it would take. This needs to be recorded along with a point system. If you complete the task on the deadline, you might get 0 points. For each day before the deadline that you complete it, you get 1 point. For each day after the deadline, you get mine one point.\\n\\nUsing a sliding window, you can see how your productivity goes up and down over, say the last 30 to 90 days. Keep in mind that while you could theoretically give yourself a deadline far enough in the future so that you guarantee yourself that you’ll always be ahead of the deadline, in reality there are checks in place to prevent this. Realistically, there is a deadline when something needs to be completed and managers are generally under pressure to achieve those deadlines. There are also other coworkers who might do the same work, and it would be rather bad if you said it would take you a week to do something when all the others say that they could do it in a few days. Any competent worker will by nature see that there will be tasks that they get done ahead of the deadline, on the deadline and past the deadline. But with experience, their estimates are generally accurate and they tend to fluctuate around their baseline.\\n\\nFor decades companies have been using project management software to manage project tasks and project deadlines. Because starting one task may be dependent on someone else first completing their task, a person may not reach their deadline if the other person fails to reach theirs. For example, a person writing the code for an app to create a screen on an app may depend on a UI designer to first complete the screen design. Whenever someone fails to reach their deadline, those dependent on them cannot be penalized for not reaching theirs. Instead of depending on deadlines which can routinely change, you really need to depend on the amount of time that the team member allocated for a task. If they estimated that a task takes 5 days, it doesn’t matter when the task starts. What matters is that when they start, they complete it within 5 days.\\n\\nIn order to tell if someone is more productive at home that they are in the office, the employee needs to first work in the office full time for a period, which should be at least 3 months. Once their performance baseline is determined for the office, they then switch to working fully remotely for the same duration. Their home performance is then compared to their office performance.\\n\\nIn most cases, their performance will increase at home for two important reasons. The first is that they are saving on their commute time which lowers stress levels. This is especially important if they are married and have children because it means that the time they would normally spend commuting, they can spend with their family, or use this time for other purposes that can result in less stress. The other reason why they should perform better at home is because there are generally less distractions. Most people who work at the office are often interrupted by people coming by, constant meetings and the sense of being managed on a microscale level. These distractions tend to die down when working remotely. Even when I worked in an office, I would usually just send a Slack message to my co-worker sitting next to me because it was less distracting for them. They can read the message when they get a chance.\\n\\nThere is of course the possibility that performance goes down for some individuals when they work remotely. Perhaps there are more distractions at home. When productivity goes down when working remotely, a company shouldn’t necessarily jump to the conclusion that remote working is entirely bad and terminate it. If productivity only goes down a small amount but there are savings on renting office space, it may make sense to simply live with the lower productivity if the cost savings is worth it. CEOs should never make a general assessment of all workers when only some workers have lower productivity working remotely while the majority don’t. Performance is all about an individual and not a group. A group’s performance is simply the cumulative performance of all the members in the group.\\n\\nWhen using a performance measurement system - it should never be used for the sake of monitoring performance alone. Most people want to be rewarded for their performance. Better pay, a higher position in the company, more holidays or even time off, whatever. The amount of reward should be tied to the amount of performance improvement. A company should have a clear policy on how they plan on rewarding employees and tie it to a metric that can be measured. By rewarding productive employees, a company increases the chance of retaining the employee.\\n\\nBack in the 90s I worked for a company called Unitron who was manufacturer of hearing aids.Their products were considered the best quality hearing aids on the market at the time. This was the result of top engineering, highly efficient production processes, but most of all, employees who simply loved their job. The company employed a performance measurement system that not only helped in creating a high quality manufacturing environment but made its employees feel proud in producing some of the best hearing aids in the world. As a result, many employees remained at this company for decades and some for their entire careers.\\n\\nIn 2024, the following are just some of the companies that are hiring fully remote workers:\\n\\n* Creative Financial Staffing (CFS)\\n* LHH – Lee Hecht Harrison\\n* UnitedHealth Group\\n* Prime Therapeutics\\n* Guidehouse\\n* TELUS\\n* Thermo Fisher Scientific\\n* Kelly\\n* Samsara\\n* Motion Recruitment\\n* Randstad\\n* Zscaler\\n* Insight Global\\n* Vaco\\n* Cloudflare\\n* Rubrik\\n* Kforce\\n* Canonical\\n* Circle Internet Financial\\n* Token Metrics",
  "author": {
    "id": "johannrosenberg",
    "name": "Johann Rosenberg",
    "bio": "Software developer that specializes in Android and web development. Have been developing software applications since the mid 1980s and wrote my first program using a punch card on mainframe computer. Born and raised in Canada, I have lived in Israel and now reside in Germany.",
    "photo": "johann.jpg",
    "url1": "https://github.com/JohannRosenberg",
    "url2": "https://www.linkedin.com/in/johannrosenberg/"
  },
  "level": "hard"
}